Merge pull request #10 from vietlvq2609/8-featappsapi-support-presigned-url-file-uploads-to-reduce-api-server-load
[feat](apps/api): Support presigned URL file uploads to reduce API server load #8
